In [53]:
import pandas as pd
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt

In [54]:
data=pd.read_csv('gold_rate_history.csv')
print(data.shape)
print(data.head())

(4971, 6)
       Date Country      State Location  Pure Gold (24 k)  \
0  1/2/2006   India  Tamilnadu  Chennai             768.0
1  1/3/2006   India  Tamilnadu  Chennai             770.5
2  1/4/2006   India  Tamilnadu  Chennai             784.5
3  1/5/2006   India  Tamilnadu  Chennai             782.5
4  1/6/2006   India  Tamilnadu  Chennai             776.0

   Standard Gold (22 K)
0                 711.0
1                 713.0
2                 726.0
3                 725.0
4                 719.0

In [55]:
data["Date"]=pd.to_datetime(data["Date"])
data['Date']=data['Date'].map(dt.datetime.toordinal)
y=data["Pure Gold (24 k)"]
print(data)

        Date Country      State Location  Pure Gold (24 k)  \
0     732313   India  Tamilnadu  Chennai             768.0
1     732314   India  Tamilnadu  Chennai             770.5
2     732315   India  Tamilnadu  Chennai             784.5
3     732316   India  Tamilnadu  Chennai             782.5
4     732317   India  Tamilnadu  Chennai             776.0
...      ...     ...        ...      ...               ...
4966  737704   India  Tamilnadu  Chennai            5103.0
4967  737705   India  Tamilnadu  Chennai            5046.0
4968  737706   India  Tamilnadu  Chennai            5051.0
4969  737707   India  Tamilnadu  Chennai            5093.0
4970  737708   India  Tamilnadu  Chennai            5124.0

      Standard Gold (22 K)
0                    711.0
1                    713.0
2                    726.0
3                    725.0
4                    719.0
...                    ...
4966                4860.0
4967                4806.0
4968                4810.0
4969                4850.0
4970                4881.0

[4971 rows x 6 columns]

# calculating mean